---
kind: other
id: Properties.T:Autodesk.Revit.DB.KeyBasedTreeEntries
source: html/30be30cf-52fd-2e59-16b2-227af985a61b.htm
---
# KeyBasedTreeEntries Properties

Specifies whether the .NET object represents a valid Revit entity.